let AffixList=[{
    id:1,
    main:['生命力'],
    sub:['生命力%數','攻擊力','攻擊力%數','防禦力','防禦力%數','速度', '暴擊率', '暴擊傷害', '效果抵抗', '效果命中', '擊破特攻']   
},{
    id:2,
    main:['攻擊力'],
    sub:['生命力','生命力%數','攻擊力%數','防禦力','防禦力%數','速度', '暴擊率', '暴擊傷害', '效果抵抗', '效果命中', '擊破特攻']
},{
    id:3,
    main: ["攻擊力%數", "生命力%數", "防禦力%數", "暴擊率", "暴擊傷害", "治療加成", "效果命中"],
    sub:['生命力','生命力%數','攻擊力','攻擊力%數','防禦力','防禦力%數','速度', '暴擊率', '暴擊傷害', '效果抵抗', '效果命中', '擊破特攻']
},{
    id:4,
    main: ["攻擊力%數", "生命力%數", "防禦力%數", "速度"],
    sub: ['生命力','生命力%數','攻擊力','攻擊力%數','防禦力','防禦力%數','速度', '暴擊率', '暴擊傷害', '效果抵抗', '效果命中', '擊破特攻']
},{
    id:5,
    main: ["攻擊力%數", "生命力%數", "防禦力%數", "擊破特攻","能量充能效率"],
    sub: ['生命力','生命力%數','攻擊力','攻擊力%數','防禦力','防禦力%數','速度', '暴擊率', '暴擊傷害', '效果抵抗', '效果命中', '擊破特攻']
},{
    id:6,
    main:["攻擊力%數", "生命力%數", "防禦力%數", "物理傷害加成", "火屬性傷害加成", "冰屬性傷害加成", "雷屬性傷害加成", "風屬性傷害加成", "量子屬性傷害加成", "虛數屬性傷害加成"],
    sub:['生命力','生命力%數','攻擊力','攻擊力%數','防禦力','防禦力%數','速度', '暴擊率', '暴擊傷害', '效果抵抗', '效果命中', '擊破特攻']
}]

export default AffixList;